{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "Aviation",
    "1": "Commercial",
    "2": "Community & Instituitional",
    "3": "Community & Institutional",
    "4": "Data Center",
    "5": "Healthcare",
    "6": "Hotel & Resort",
    "7": "Industrial",
    "8": "Infrastructure",
    "9": "Mining & Resources",
    "10": "Mixed Use Development",
    "11": "Residential",
    "12": "Water & Environment",
    "13": "commercial",
    "14": "residential"
  },
  "initializer_range": 0.02,
  "label2id": {
    "Aviation": 0,
    "Commercial": 1,
    "Community & Instituitional": 2,
    "Community & Institutional": 3,
    "Data Center": 4,
    "Healthcare": 5,
    "Hotel & Resort": 6,
    "Industrial": 7,
    "Infrastructure": 8,
    "Mining & Resources": 9,
    "Mixed Use Development": 10,
    "Residential": 11,
    "Water & Environment": 12,
    "commercial": 13,
    "residential": 14
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.55.4",
  "vocab_size": 30522
}
